{
  "defaultImage": "/sample-user.png",
  "profiles": [
    {
      "name": "Myra Tait",
      "role": "host",
      "title": "Assistant Professor of Governence and Law & Management, Athabasca University",
      "image": "/mtait-linkedin.jfif",
      "linkedin": "https://www.linkedin.com/in/myra-j-tait-lawyer-592bbb53/",
      "twitter": "https://twitter.com/mjtait22",
      "description": "Myra is a proud member of Berens River First Nation in Treaty #5 territory. She holds a Juris Doctor (Law) degree and a Master of Laws, which examined the relationship between the taxation provisions of the Indian Act and the Numbered Treaties. She has conducted research in New Zealand and Australia on Constitutional inclusion of Indigenous peoples, and has presented on this research in multiple international forums. In response to Canada’s recent celebration of colonization, she co-edited Surviving Canada: Indigenous Peoples Celebrate 150 Years of Betrayal (2017). She received her Call to the Manitoba Bar in 2018, and practiced Aboriginal law, working with First Nations in Manitoba. Myra’s legal work and teaching spans topics in governance, community sustainable development, and taxation. Her research currently focuses on social justice in the areas of First Nations children, policy development, and health equity. Advancing conciliation and social justice for and with Indigenous peoples, including within the academe, drives Myra’s service, research, and teaching."
    },
    {
      "name": "Makayla LeSann",
      "role": "host",
      "title": "Research Assistant"
    },
    {
      "name": "Dr. Josie Auger",
      "role": "host",
      "title": "Associate Professor of Indigenous Studies, Athabasca University",
      "image": "/jauger-linkedin.jfif",
      "linkedin": "https://www.linkedin.com/in/dr-josie-auger-5902b169/",
      "description": "Listening to Cree women share their Invasion of Sexual Boundaries using Indigenous Research Methodology and going through the Research Ethics Board process at the university led to seeking institutional and SSHRC Connections Grant funding for this event. As a researcher working with Cree women from my own community, we used sacred teachings and natural laws to address self-determination and sovereignty. While we will be kikapekiskwewin (having a future conversation) about why cultural values are so important to Indigenous researchers involved in research with Indigenous people, we would like to invite you to attend and listen or even share your university research ethics board experience to obtain approval using Indigenous research methodology. I am a trusted listener from Bigstone Cree Nation in Treaty 8 (Turtle Island), and earned my PhD in 2010 in Public Health Sciences at the University of Alberta. Currently, I am an Associate Professor at Athabasca University in Indigenous Studies, in the Faculty of Humanities and Social Sciences."
    },
    {
      "name": "Dr. Nisha Nath",
      "role": "host",
      "title": "Assistant Professor of Equity Studies, Athabasca University",
      "image": "/nnath-linkedin.jfif",
      "linkedin": "https://www.linkedin.com/in/nisha-nath-phd-aa4b0a94/",
      "description": "Nisha Nath (she/they) is a political scientist, and an Assistant Professor of Equity Studies at Athabasca University, and an associate member of the Faculty of Graduate Studies at the University of Lethbridge. She is currently located in Amiskwaciwâskahikan (colonially known as Edmonton), in Treaty 6. Her work takes a critical approach to citizenship, focusing on the intersections of race and racism, relational securitization, and settler colonialism. In addition to collaborating on kikapekiskwewin, she is working on two other major projects. Along with an interdisciplinary team of scholars in the Canada and UK, the first is a British Academy funded project on racial capitalism and security; and, second, a SSHRC-IDG funded project with Dr. Willow Samara Allen on the settler-colonial socialization of public sector workers. She is on the editorial board of Athabasca University Press, a producer with the podcast Academic Aunties, and her work has appeared in the journals <em>Citizenship Studies, Studies in Social Justice, Feminist Studies, Canadian Journal of Political Science, Canadian Ethnic Studies,</em> as well as several edited collections."
    },
    {
      "name": "Dr. Carolyn Greene",
      "role": "host",
      "title": "Associate Professor of Criminal Justice, Athabasca University"
    }
  ]
}
